package com.alpha.kooing.reward.enum

enum class RewardRequirementType {
    회원가입,
    출석체크_3일,
    출석체크_7일,
    출석체크_2주,
    출석체크_1달,
    메이트랑_1일_이상_채팅,
    메이트랑_3일_이상_채팅,
    메이트랑_5일_이상_채팅,
    자유게시판_댓글_1개_이상_작성,
    자유게시판_좋아요_1개_이상,
    자유게시판_스크랩_1개_이상,
    자유게시판_글_1개_이상_작성,
    자유게시판_댓글_5개_이상_작성,
    자유게시판_좋아요_5개_이상,
    자유게시판_스크랩_5개_이상,
    자유게시판_글_3개_이상_작성,
    지원정책_스크랩_3개_이상,
    지원사업_스크랩_3개_이상,
    채용공고_스크랩_3개_이상,
    채팅_100개_이상,
    채팅_200개_이상,
    채팅_300개_이상,
    스터디_봉사활동_동아리_중_글_1개_이상_작성
}